In [1]:
import pandas as pd

In [2]:
bank_df = pd.read_csv('C:\\Users\\flowe\\OneDrive - San Francisco State University\\Project_Expert_GitHub\\Project_Python\\JupyterNotebookWorkingSpace\\PerfectGuid\\1장\\bank.csv')
print(type(bank_df))

<class 'pandas.core.frame.DataFrame'>

In [3]:
bank_df.head(20)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes
5,42,management,single,tertiary,no,0,yes,yes,unknown,5,may,562,2,-1,0,unknown,yes
6,56,management,married,tertiary,no,830,yes,yes,unknown,6,may,1201,1,-1,0,unknown,yes
7,60,retired,divorced,secondary,no,545,yes,no,unknown,6,may,1030,1,-1,0,unknown,yes
8,37,technician,married,secondary,no,1,yes,no,unknown,6,may,608,1,-1,0,unknown,yes
9,28,services,single,secondary,no,5090,yes,no,unknown,6,may,1297,3,-1,0,unknown,yes
10,38,admin.,single,secondary,no,100,yes,no,unknown,7,may,786,1,-1,0,unknown,yes
11,30,blue-collar,married,secondary,no,309,yes,no,unknown,7,may,1574,2,-1,0,unknown,yes
12,29,management,married,tertiary,no,199,yes,yes,unknown,7,may,1689,4,-1,0,unknown,yes
13,46,blue-collar,single,tertiary,no,460,yes,no,unknown,7,may,1102,2,-1,0,unknown,yes
14,31,technician,single,tertiary,no,703,yes,no,unknown,8,may,943,2,-1,0,unknown,yes
15,35,management,divorced,tertiary,no,3837,yes,no,unknown,8,may,1084,1,-1,0,unknown,yes
16,32,blue-collar,single,primary,no,611,yes,no,unknown,8,may,541,3,-1,0,unknown,yes
17,49,services,married,secondary,no,-8,yes,no,unknown,8,may,1119,1,-1,0,unknown,yes
18,41,admin.,married,secondary,no,55,yes,no,unknown,8,may,1120,2,-1,0,unknown,yes
19,49,admin.,divorced,secondary,no,168,yes,yes,unknown,8,may,513,1,-1,0,unknown,yes

In [11]:
print("columns:", bank_df.columns)
print("index:",bank_df.index)
print("index value:", bank_d`f.index.values)

columns: Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'deposit'],
      dtype='object')
index: RangeIndex(start=0, stop=11162, step=1)
index value: [    0     1     2 ... 11159 11160 11161]

In [4]:
print('DataFrame 크기 : ',bank_df.shape)

DataFrame 크기 :  (11162, 17)

In [5]:
bank_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11162 entries, 0 to 11161
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        11162 non-null  int64
 1   job        11162 non-null  object
 2   marital    11162 non-null  object
 3   education  11162 non-null  object
 4   default    11162 non-null  object
 5   balance    11162 non-null  int64
 6   housing    11162 non-null  object
 7   loan       11162 non-null  object
 8   contact    11162 non-null  object
 9   day        11162 non-null  int64
 10  month      11162 non-null  object
 11  duration   11162 non-null  int64
 12  campaign   11162 non-null  int64
 13  pdays      11162 non-null  int64
 14  previous   11162 non-null  int64
 15  poutcome   11162 non-null  object
 16  deposit    11162 non-null  object
dtypes: int64(7), object(10)
memory usage: 1.4+ MB

In [6]:
bank_df.describe()

,age,balance,day,duration,campaign,pdays,previous
count,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000,11162.000000
mean,41.231948,1528.538524,15.658036,371.993818,2.508421,51.330407,0.832557
std,11.913369,3225.413326,8.420740,347.128386,2.722077,108.758282,2.292007
min,18.000000,-6847.000000,1.000000,2.000000,1.000000,-1.000000,0.000000
25%,32.000000,122.000000,8.000000,138.000000,1.000000,-1.000000,0.000000
50%,39.000000,550.000000,15.000000,255.000000,2.000000,-1.000000,0.000000
75%,49.000000,1708.000000,22.000000,496.000000,3.000000,20.750000,1.000000
max,95.000000,81204.000000,31.000000,3881.000000,63.000000,854.000000,58.000000

In [7]:
value_counts = bank_df['age'].value_counts()
print(value_counts)

31    496
32    477
34    466
33    464
35    461
     ...
92      2
93      2
90      2
89      1
95      1
Name: age, Length: 76, dtype: int64

In [8]:
bank_age = bank_df['age']
print(type(bank_age))

<class 'pandas.core.series.Series'>

In [9]:
bank_age.head()

0    59
1    56
2    41
3    55
4    54
Name: age, dtype: int64

In [15]:
bank_df.sort_values(by = 'age', ascending = True)

bank_df[['age', 'job', 'balance']].sort_values(by = ['age', 'balance'], ascending = [True, False])

      age      job  balance
2498   18  student      608
2935   18  student      608
3494   18  student      348
2464   18  student      108
2654   18  student      108
...   ...      ...      ...
2802   92  retired      775
3098   92  retired      775
3756   93  retired      775
3822   93  retired      775
1582   95  retired     2282

[11162 rows x 3 columns]

In [16]:
import numpy as np

bank_df['age_0'] = 0
bank_df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit,age_0
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes,0
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes,0
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes,0
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes,0
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes,0

In [18]:
bank_df["age_0"] = bank_df['age'] * 10
bank_df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit,age_0
0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes,590
1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes,560
2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes,410
3,55,services,married,secondary,no,2476,yes,no,unknown,5,may,579,1,-1,0,unknown,yes,550
4,54,admin.,married,tertiary,no,184,no,no,unknown,5,may,673,2,-1,0,unknown,yes,540

In [26]:
bank_drop_df = bank_df.drop('age_0', axis=1)
bank_drop_df.head(3)
bank_drop_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11162 entries, 0 to 11161
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        11162 non-null  int64
 1   job        11162 non-null  object
 2   marital    11162 non-null  object
 3   education  11162 non-null  object
 4   default    11162 non-null  object
 5   balance    11162 non-null  int64
 6   housing    11162 non-null  object
 7   loan       11162 non-null  object
 8   contact    11162 non-null  object
 9   day        11162 non-null  int64
 10  month      11162 non-null  object
 11  duration   11162 non-null  int64
 12  campaign   11162 non-null  int64
 13  pdays      11162 non-null  int64
 14  previous   11162 non-null  int64
 15  poutcome   11162 non-null  object
 16  deposit    11162 non-null  object
dtypes: int64(7), object(10)
memory usage: 1.4+ MB

In [31]:
bank_df = pd.read_csv('C:\\Users\\flowe\\OneDrive - San Francisco State University\\Project_Expert_GitHub\\Project_Python\\JupyterNotebookWorkingSpace\\PerfectGuid\\1장\\bank.csv')
indexes = bank_df.index
print(indexes.values)

[    0     1     2 ... 11159 11160 11161]

In [32]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(11162,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [34]:
series_balance = bank_df['balance']
series_balance.head(5)

0    2343
1      45
2    1270
3    2476
4     184
Name: balance, dtype: int64

In [35]:
print('balance Series max 값:', series_balance.max())
print('balance Series sum 값:', series_balance.sum())
print('sum() balance Series:', sum(series_balance))
print('balance Series + 3:\n',(series_balance + 3).head(3) )

balance Series max 값: 81204
balance Series sum 값: 17061547
sum() balance Series: 17061547
balance Series + 3:
 0    2346
1      48
2    1273
Name: balance, dtype: int64

In [37]:
bank_reset_df = bank_df.reset_index(inplace = False)
bank_reset_df.head(3)

,index,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,0,59,admin.,married,secondary,no,2343,yes,no,unknown,5,may,1042,1,-1,0,unknown,yes
1,1,56,admin.,married,secondary,no,45,no,no,unknown,5,may,1467,1,-1,0,unknown,yes
2,2,41,technician,married,secondary,no,1270,yes,no,unknown,5,may,1389,1,-1,0,unknown,yes

In [38]:
bank_reset_df.shape

(11162, 18)

In [50]:
bank_df[ bank_df['age'] == 20 ].head(3)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
1446,20,student,single,secondary,no,1819,no,no,cellular,9,apr,245,3,-1,0,unknown,yes
2089,20,blue-collar,single,secondary,no,76,yes,no,cellular,18,may,639,2,-1,0,unknown,yes
2405,20,student,single,unknown,no,829,no,no,cellular,9,jul,253,2,-1,0,unknown,yes

In [52]:
bank_bool = bank_df[bank_df['age'] == 18]
print(type(bank_bool))
bank_bool

<class 'pandas.core.frame.DataFrame'>

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
2464,18,student,single,unknown,no,108,no,no,cellular,10,aug,167,1,-1,0,unknown,yes
2498,18,student,single,primary,no,608,no,no,cellular,12,aug,267,1,-1,0,unknown,yes
2654,18,student,single,unknown,no,108,no,no,cellular,8,sep,169,1,-1,0,unknown,yes
2935,18,student,single,primary,no,608,no,no,cellular,13,nov,210,1,93,1,success,yes
3174,18,student,single,unknown,no,108,no,no,cellular,9,feb,92,1,183,1,success,yes
3494,18,student,single,unknown,no,348,no,no,cellular,5,may,443,4,-1,0,unknown,yes
4219,18,student,single,unknown,no,3,no,no,cellular,25,aug,130,2,-1,0,unknown,yes
6456,18,student,single,secondary,no,5,no,no,cellular,24,aug,143,2,-1,0,unknown,no

In [55]:
bank_df['age'] <= 20
var1 = bank_df['age'] <= 20
print(var1)
print(type(var1))

0        False
1        False
2        False
3        False
4        False
         ...
11157    False
11158    False
11159    False
11160    False
11161    False
Name: age, Length: 11162, dtype: bool
<class 'pandas.core.series.Series'>

In [57]:
bank_df[bank_df['age'] <= 20][ ['age', 'job', 'balance'] ].head(10)

      age          job  balance
1385   19      student      134
1446   20      student     1819
2089   20  blue-collar       76
2405   20      student      829
2406   19      student      103
2434   20      student      292
2464   18      student      108
2493   20      student     6991
2498   18      student      608
2574   20      student      215

In [67]:
bank_df.loc[(bank_df['age'] <= 24) & (bank_df['job'] != 'student'), ['age', 'job', 'balance']].head(10)

      age           job  balance
39     23  entrepreneur        4
83     24    technician      409
146    24   blue-collar      685
160    23      services      665
220    23      services      425
230    23   blue-collar      492
294    24   blue-collar     -203
348    24    management      867
1087   23    unemployed     1003
1166   22        admin.      897

In [68]:
bank_df.count()

age          11162
job          11162
marital      11162
education    11162
default      11162
balance      11162
housing      11162
loan         11162
contact      11162
day          11162
month        11162
duration     11162
campaign     11162
pdays        11162
previous     11162
poutcome     11162
deposit      11162
dtype: int64

In [71]:
bank_df[['age', 'balance']].mean(axis=0)

age          41.231948
balance    1528.538524
dtype: float64

In [72]:
bank_df[['age', 'balance']].mean()

age          41.231948
balance    1528.538524
dtype: float64

In [73]:
bank_df[['age', 'balance']].sum(axis=0)

age          460231
balance    17061547
dtype: int64

In [78]:
bank_groupby = bank_df.groupby(by = 'job')
print(type(bank_groupby))
print(bank_groupby)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001D2201A7640>

In [88]:
bank_groupby = bank_df.groupby('job').median()
bank_groupby

                age  balance   day  duration  campaign  pdays  previous
job
admin.         37.0    464.0  15.0     228.5       2.0   -1.0       0.0
blue-collar    39.0    460.5  15.0     263.0       2.0   -1.0       0.0
entrepreneur   41.5    399.0  16.0     248.5       2.0   -1.0       0.0
housemaid      48.0    444.0  16.0     206.0       2.0   -1.0       0.0
management     38.0    630.0  16.0     251.0       2.0   -1.0       0.0
retired        64.0   1087.5  15.0     301.0       1.5   -1.0       0.0
self-employed  37.0    581.0  16.0     256.0       2.0   -1.0       0.0
services       37.0    406.0  15.0     262.0       2.0   -1.0       0.0
student        25.0    489.5  14.0     253.0       1.0   -1.0       0.0
technician     37.0    542.0  16.0     250.0       2.0   -1.0       0.0
unemployed     40.0    660.0  14.0     317.0       2.0   -1.0       0.0
unknown        46.5    819.0  13.5     266.5       2.0   -1.0       0.0

In [84]:
print(type(bank_groupby))
print(bank_groupby.shape)
print(bank_groupby.index)

<class 'pandas.core.frame.DataFrame'>
(12, 16)
Index(['admin.', 'blue-collar', 'entrepreneur', 'housemaid', 'management',
       'retired', 'self-employed', 'services', 'student', 'technician',
       'unemployed', 'unknown'],
      dtype='object', name='job')

In [95]:
bank_groupby = bank_df.groupby(by = 'job')[['age', 'balance']].mean()
bank_groupby

                     age      balance
job
admin.         39.374063  1195.866567
blue-collar    39.505144  1203.926440
entrepreneur   42.887195  1621.942073
housemaid      47.445255  1366.160584
management     40.218239  1793.663679
retired        65.424165  2417.250643
self-employed  39.809877  1865.372840
services       38.141928  1081.171181
student        26.102778  1500.783333
technician     39.001646  1556.294569
unemployed     40.997199  1314.719888
unknown        46.857143  1945.457143

In [97]:
bank_df.groupby('job')['age', 'balance'].agg([min, max])

              age     balance
              min max     min    max
job
admin.         20  72   -1415  56831
blue-collar    20  63   -1489  66653
entrepreneur   21  84   -1965  51439
housemaid      22  82   -1531  26965
management     21  78   -6847  36252
retired        34  95   -1206  81204
self-employed  22  76   -3058  52587
services       21  69   -1139  23592
student        18  47       0  23878
technician     21  71   -1944  45248
unemployed     21  65    -825  16397
unknown        26  78       0  19268

In [101]:
agg_format = {'age' : ['min', 'max'], 'balance' : 'mean'}
bank_df.groupby('job').agg(agg_format)a

              age          balance
              min max         mean
job
admin.         20  72  1195.866567
blue-collar    20  63  1203.926440
entrepreneur   21  84  1621.942073
housemaid      22  82  1366.160584
management     21  78  1793.663679
retired        34  95  2417.250643
self-employed  22  76  1865.372840
services       21  69  1081.171181
student        18  47  1500.783333
technician     21  71  1556.294569
unemployed     21  65  1314.719888
unknown        26  78  1945.457143

In [103]:
bank_df.isna().head(3)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [104]:
bank_df.isna().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
deposit      0
dtype: int64

In [116]:
lambda_square = lambda x : x**2
print('3의 제곱은 : ', lambda_square(3))

3의 제곱은 :  9

In [119]:
bank_df['job_len'] = bank_df['job'].apply(lambda x : len(x))
bank_df[['job', 'job_len']].head(3)

          job  job_len
0      admin.        6
1      admin.        6
2  technician       10

In [122]:
def get_category(age):
    cat = ''
    if age <= 19: cat = 'Teenager'
    elif age <= 26: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 59: cat = 'Adult'
    else : cat = 'Elderly'
    
    return cat

bank_df['age_cat'] = bank_df['age'].apply(lambda x : get_category(x))
bank_df[['age', 'age_cat']].head(10)

   age      age_cat
0   59        Adult
1   56        Adult
2   41        Adult
3   55        Adult
4   54        Adult
5   42        Adult
6   56        Adult
7   60      Elderly
8   37        Adult
9   28  Young Adult